[
    {
        "Version": "1.1.7",
        "Fixed": [ ],
        "New": [
            "On the overview page there is now a photo picker mode in order to edit several photos at once (multi edit)"
        ]
    },
    {
        "Version": "1.1.6",
        "Fixed": [ "Enter behaviour on edit screens"],
        "New": [            
            "Exif data is reduced to technical values and can be expanded to show general information",
            "Description can be added to photo",
            "New layout for detail page of photos",
            "Photos will be shown in full size",
            "New photos will only be show the the member, until he edits it"
        ]
    },
    {
        "Version": "1.1.5",
        "Fixed": [
            "Photo thumnbnails are now a link and can be opened in a new browser window via context menu",
            "On moving between photos with the left and right key, changes made before are shown",
            "Photo count for categories corrected",
            "On the overview page loading of more photos doesn't stop on scaling down anymore"
        ],
        "New": [
            "Keywords will be matched to existing categries and topics if possible. If a keyword cannot be matched NO new topic will be created.",
            "Added possibility to update existing photos via upload. See the new menu item on the photo page.",
            "A new option has been add to update existing photos when uploading or synchronising photos. In order for this to work the name of the file has to match the name of existing photo.",
            "Photos which cannot be processed will be moved to Glitch-Folder",
            "Set visible area of your photo",
            "Scaling on overview is now stored in a cookie to preserve it"
        ]
    },
    {
        "Version": "1.1.4",
        "Fixed": [
            "Rotation of photo will be recognized if Exif-data is avaliable and picture ajdusted accordingly",
            "Date values are read correctly from Exif-data",
            "Synchronizing via dropbox webhook will not create multiple folders anymore"
        ],
        "New": [
            "Photo page: Move to previous or next photo via button or hotkey|https://trello.com/c/sViddicI/260-darius-foto-cursor-nachstes-vorheriges-bild-in-chronologischer-reihenfolge",
            "New dismiss button on notifications",
            "Photos title in browsers title bar",
            "Photo title will be displayed in notifications"
        ]
    },
    {
        "Version": "1.1.3",
        "Fixed": [
            "Annoying subpixel problem on startpage and overview grids solved"
        ],
        "New": [
            "Lazy load feature on Overview|https://trello.com/c/GxIxiDzS/55-overview-lazyload",
            "New implementation of lazy load feature on stacked pages like Journal, Categories and others",
            "New size ratios for portrait and landscape photos on stacked pages"
        ]
    },
    {
        "Version": "1.1.2",
        "Fixed": [ ],
        "New": [
            "Overview has now two different views: Grid and List"
        ]
    },
    {
        "Version": "1.1.1",
        "Fixed": [ ],
        "New": [
            "Overview has a new scale control, to easily adjust the width of the photos in the grid"
        ]
    },
    {
        "Version": "1.1.0",
        "Fixed": [
            "Every responsive breakpoint has now its own number of photos on the startpage, regarding a percentage width|https://trello.com/c/BTNwa49s/248-sandra-zecchino-kachelgrosse-selbt-wahlen"
        ],
        "New": [
            "Introduction of the photo attribute 'Is for stories only', to prevent showing a photo in the public collections",
            "Browser-independent tooltips on image buttons",
            "Slideshow button on every stacked page, like Journal, Categories, ...|https://trello.com/c/ILSYuNAP/249-sandra-zecchino-diashow"
        ]
    },
    {
        "Version": "1.0.9",
        "Fixed": [
            "Error while saving new event|https://trello.com/c/05neMHzV/240-fehler-beim-speichern-eines-events-auto-exception",
            "Photos disappear after sync on GoogleDrive and OneDrive|https://trello.com/c/jWAfXi86/244-ivan-andric-fotos-verschwunden"
        ],
        "New": [
            "START OF THIS CHANGELOG",
            "Implementation of HTML templates für mail notifications",
            "Showing the amount of stars in rating mail notification|https://trello.com/c/hSVR3NWv/217-sandra-zecchino-in-notification",
            "Hash routing for the tabs on the dashboard",
            "Auto-sizing of the dashboard tabs in multiple rows according to the canvas width"
        ]
    }
]
